Repository: Yugalpatidar05/User_mydocs
Catalog: source/locale/*/LC_MESSAGES/index.po
Languages: it

source: Introduction
it: Introduzione

source: Welcome to the documentation for the GeneSys Admin web application. Use the menu below to navigate through the key features and functionalities.
it: Benvenuto nella documentazione dell'applicazione web GeneSys Admin. Usa il menu sottostante per navigare tra le funzionalità principali.

source: Accessing GeneSys Admin
it: Accesso a GeneSys Admin

source: To access the GeneSys Admin web application, please follow these steps:
it: Per accedere all'applicazione web GeneSys Admin, segui questi passaggi:

source: **Login**: Go to the GeneSys Admin website and log in with your credentials.
it: **Login**: Vai al sito web di GeneSys Admin e accedi con le tue credenziali.

source: Navigating the Dashboard
it: Navigazione nel cruscotto

source: Optional alt text for the image
it: Testo alternativo opzionale per l'immagine

source: The GeneSys Admin dashboard serves as a central hub for managing various aspects of the application.
it: Il cruscotto di GeneSys Admin funge da centro per gestire vari aspetti dell'applicazione.

source: Menu Bar
it: Barra del menu

source: The menu bar on the left-hand side provides access to the following options:
it: La barra del menu sul lato sinistro fornisce accesso alle seguenti opzioni:

source: **View Leads**: Displays a list of all existing leads.
it: **Visualizza Lead**: Mostra un elenco di tutti i lead esistenti.

source: **Create Lead**: Allows users to add new leads to the system.
it: **Crea Lead**: Consente agli utenti di aggiungere nuovi lead al sistema.

source: **Import Leads**: Facilitates the import of leads from external sources.
it: **Importa Lead**: Facilita l'importazione di lead da fonti esterne.

source: This section provides a detailed overview of the "Leads" feature, including navigation, CRUD operations, table columns, and additional functionalities.
it: Questa sezione fornisce una panoramica dettagliata della funzionalità "Lead", inclusi navigazione, operazioni CRUD, colonne della tabella e funzionalità aggiuntive.

source: Navigating to Leads
it: Navigare verso Lead

source: To access the "Leads" section:
it: Per accedere alla sezione "Lead":

source: On the **Home Page**, locate the **Sidebar Menu**.
it: Nella **Home Page**, individua il **Menu Laterale**.

source: Click on the **Leads** menu item. This will expand a dropdown menu.
it: Clicca sull'elemento di menu **Lead**. Questo espanderà un menu a discesa.

source: Select **View Leads** to open the leads management page.
it: Seleziona **Visualizza Lead** per aprire la pagina di gestione dei lead.

source: Viewing Leads
it: Visualizzazione dei Lead

source: The **View Leads** page displays all saved leads in a table format. The table includes the following columns:
it: La pagina **Visualizza Lead** mostra tutti i lead salvati in formato tabellare. La tabella include le seguenti colonne:

source: Lead Table Columns
it: Colonne della Tabella dei Lead

source: **Contact ID**: - A unique identifier assigned to each lead. - This column helps to differentiate between leads easily.
it: **ID Contatto**: - Un identificatore unico assegnato a ciascun lead. - Questa colonna aiuta a differenziare facilmente i lead.

source: **Email**: - The email address of the lead. - This column allows users to view and verify contact information.
it: **Email**: - L'indirizzo email del lead. - Questa colonna consente agli utenti di visualizzare e verificare le informazioni di contatto.

source: **First Name**: - The first name of the lead. - This field provides clarity on the lead's identity.
it: **Nome**: - Il nome del lead. - Questo campo fornisce chiarezza sull'identità del lead.

source: **Last Name**: - The last name of the lead. - Together with the first name, it fully identifies the lead.
it: **Cognome**: - Il cognome del lead. - Insieme al nome, identifica completamente il lead.

source: **Phone Number**: - The contact phone number of the lead. - This column is used for direct communication with the lead.
it: **Numero di Telefono**: - Il numero di telefono di contatto del lead. - Questa colonna viene utilizzata per la comunicazione diretta con il lead.

source: **Tag**: - A label or keyword associated with the lead. - Tags can help categorize or filter leads for better management.
it: **Tag**: - Un'etichetta o parola chiave associata al lead. - I tag possono aiutare a categorizzare o filtrare i lead per una gestione migliore.

source: **Created At**: - The date and time when the lead was created. - This field helps track when the lead was added.
it: **Creato Il**: - La data e l'ora in cui il lead è stato creato. - Questo campo aiuta a tracciare quando il lead è stato aggiunto.

source: **Updated At**: - The date and time when the lead was last updated. - Useful for identifying recent changes.
it: **Aggiornato Il**: - La data e l'ora in cui il lead è stato aggiornato l'ultima volta. - Utile per identificare i cambiamenti recenti.

source: **CRM Campaign**: - A text column containing the name or type of CRM campaign associated with the lead. - This helps link leads to specific marketing campaigns.
it: **Campagna CRM**: - Una colonna di testo contenente il nome o il tipo di campagna CRM associata al lead. - Questo aiuta a collegare i lead a specifiche campagne di marketing.

source: **Lead Owner**: - A dropdown column allowing selection of the lead's owner. - The dropdown is searchable for convenience.
it: **Proprietario del Lead**: - Una colonna a discesa che permette di selezionare il proprietario del lead. - La discesa è ricercabile per comodità.

source: **Organization**: - The organization the lead is associated with. - This provides context on the lead's professional background.
it: **Organizzazione**: - L'organizzazione con cui il lead è associato. - Questo fornisce contesto sul background professionale del lead.

source: **Designation**: - The professional title or role of the lead within their organization. - Helps understand the lead’s position in their company.
it: **Designazione**: - Il titolo professionale o il ruolo del lead all'interno della sua organizzazione. - Aiuta a comprendere la posizione del lead nell'azienda.

source: **Country**: - A searchable dropdown that provides a list of countries to select from. - Users can easily assign a country to the lead for regional tracking.
it: **Paese**: - Una discesa ricercabile che fornisce un elenco di paesi da cui selezionare. - Gli utenti possono facilmente assegnare un paese al lead per un monitoraggio regionale.

source: **Lead Type**: - A dropdown containing predefined lead types. - Examples include "Prospect," "Customer," or "Partner."
it: **Tipo di Lead**: - Una discesa contenente tipi di lead predefiniti. - Esempi includono "Prospect", "Cliente" o "Partner".

source: **Product**: - The product or service associated with the lead. - This column helps link leads with specific offerings.
it: **Prodotto**: - Il prodotto o servizio associato al lead. - Questa colonna aiuta a collegare i lead con offerte specifiche.

source: **Lead Status**: - A dropdown containing predefined statuses for the lead. - Examples include "New," "In Progress," "Closed."
it: **Stato del Lead**: - Una discesa contenente stati predefiniti per il lead. - Esempi includono "Nuovo", "In corso", "Chiuso".

source: **Source**: - Indicates how the lead was acquired (e.g., "Website," "Referral," "Event"). - Helps track lead generation channels.
it: **Fonte**: - Indica come è stato acquisito il lead (ad esempio, "Sito Web", "Riferimento", "Evento"). - Aiuta a tracciare i canali di generazione dei lead.

source: **Follow-up Date**: - A date and time column for scheduling follow-up actions. - Ensures timely communication with leads.
it: **Data di Follow-up**: - Una colonna di data e ora per pianificare azioni di follow-up. - Garantisce una comunicazione tempestiva con i lead.

source: **Action**: - This column contains interactive icons for various actions:
it: **Azione**: - Questa colonna contiene icone interattive per varie azioni:

source: **View Icon**: Opens a detailed view of the lead.
it: **Icona di Visualizzazione**: Apre una vista dettagliata del lead.

source: **Delete Icon**: Removes the lead from the system.
it: **Icona di Eliminazione**: Rimuove il lead dal sistema.

source: **Update Icon**: Opens the lead form for editing.
it: **Icona di Aggiornamento**: Apre il modulo del lead per l'editing.

source: Managing Leads
it: Gestione dei Lead

source: Create a Lead
it: Crea un Lead

source: Navigate to the **View Leads** page.
it: Vai alla pagina **Visualizza Lead**.

source: Click the **Create CRM Contact** button.
it: Clicca sul pulsante **Crea Contatto CRM**.

source: Fill in the required fields and click **Save.**
it: Compila i campi obbligatori e clicca su **Salva.**

source: View a Lead
it: Visualizza un Lead

source: Leads are displayed in a table format with all relevant details.
it: I lead vengono visualizzati in formato tabellare con tutti i dettagli rilevanti.

source: Update a Lead
it: Aggiorna un Lead

source: On the **View Leads** page, locate the lead you want to modify.
it: Nella pagina **Visualizza Lead**, individua il lead che desideri modificare.

source: Click the **Edit** button in the **Actions** column.
it: Clicca sul pulsante **Modifica** nella colonna **Azioni**.

source: Make the necessary changes and click **Save.**
it: Apporta le modifiche necessarie e clicca su **Salva.**

source: Delete a Lead
it: Elimina un Lead

source: On the **View Leads** page, locate the lead you want to delete.
it: Nella pagina **Visualizza Lead**, individua il lead che desideri eliminare.

source: Click the **Delete** button in the **Actions** column.
it: Clicca sul pulsante **Elimina** nella colonna **Azioni**.

source: Confirm the deletion to remove the lead permanently.
it: Conferma l'eliminazione per rimuovere definitivamente il lead.

source: Users
it: Utenti

source: The "Users" module focuses on user account management, empowering administrators to control access, assign roles, and maintain user details. Refer to the **Users** section for detailed instructions on managing users.
it: Il modulo "Utenti" si concentra sulla gestione degli account utente, consentendo agli amministratori di controllare l'accesso, assegnare ruoli e mantenere i dettagli degli utenti. Consulta la sezione **Utenti** per le istruzioni dettagliate sulla gestione degli utenti.

source: Navigating to Users
it: Navigazione verso gli Utenti

source: To access the "Users" section:
it: Per accedere alla sezione "Utenti":

source: Click on the **Users** menu item. This will expand a dropdown menu.
it: Clicca sull'elemento di menu **Utenti**. Questo espanderà un menu a discesa.

source: Select **View Users** to open the user management page.
it: Seleziona **Visualizza Utenti** per aprire la pagina di gestione degli utenti.

source: Viewing Users
it: Visualizzazione degli Utenti

source: The **View Users** page displays all saved users in a table format. The table includes the following columns:
it: La pagina **Visualizza Utenti** mostra tutti gli utenti salvati in formato tabellare. La tabella include le seguenti colonne:

source: User Table Columns
it: Colonne della Tabella degli Utenti

source: **User ID**: - An auto-generated unique identifier assigned to each user. - This column helps to differentiate between users easily.
it: **ID Utente**: - Un identificatore unico generato automaticamente per ciascun utente. - Questa colonna aiuta a differenziare facilmente gli utenti.

source: **Email**: - The email address of the user. - This column allows users to view and verify contact information.
it: **Email**: - L'indirizzo email dell'utente. - Questa colonna consente agli utenti di visualizzare e verificare le informazioni di contatto.

source: **First Name**: - The first name of the user. - This field provides clarity on the user’s identity.
it: **Nome**: - Il nome dell'utente. - Questo campo fornisce chiarezza sull'identità dell'utente.

source: **Last Name**: - The last name of the user. - Together with the first name, it fully identifies the user.
it: **Cognome**: - Il cognome dell'utente. - Insieme al nome, identifica completamente l'utente.

source: **Role**: - The user’s role in the system (e.g., Admin, Manager, Staff). - Helps assign appropriate permissions and responsibilities.
it: **Ruolo**: - Il ruolo dell'utente nel sistema (ad esempio, Admin, Manager, Staff). - Aiuta ad assegnare le autorizzazioni e le responsabilità appropriate.

source: **Created At**: - The date and time when the user account was created. - Useful for tracking new accounts.
it: **Creato Il**: - La data e l'ora in cui l'account utente è stato creato. - Utile per tracciare i nuovi account.

source: **Updated At**: - The date and time when the user account was last updated. - Useful for identifying recent changes.
it: **Aggiornato Il**: - La data e l'ora in cui l'account utente è stato aggiornato l'ultima volta. - Utile per identificare i cambiamenti recenti.

source: **Product**: - The product or service associated with the user. - Useful for linking users to specific offerings.
it: **Prodotto**: - Il prodotto o servizio associato all'utente. - Utile per collegare gli utenti alle offerte specifiche.

source: **Organization**: - The organization the user is associated with. - Provides context on the user’s professional background.
it: **Organizzazione**: - L'organizzazione con cui l'utente è associato. - Fornisce contesto sul background professionale dell'utente.

source: **CRM Campaign**: - A text column containing the name or type of CRM campaign linked to the user. - Helps connect users to specific campaigns.
it: **Campagna CRM**: - Una colonna di testo contenente il nome o il tipo di campagna CRM associata all'utente. - Aiuta a collegare gli utenti a specifiche campagne.

source: **CRM Campaign Identifier**: - A unique identifier for the CRM campaign. - Enables precise tracking of campaign associations.
it: **Identificatore Campagna CRM**: - Un identificatore unico per la campagna CRM. - Consente un tracciamento preciso delle associazioni della campagna.

source: **CRM Campaign Timestamp**: - The date and time related to the CRM campaign activity. - Useful for campaign timeline tracking.
it: **Timestamp Campagna CRM**: - La data e l'ora relative all'attività della campagna CRM. - Utile per il tracciamento della timeline della campagna.

source: **CRM Source**: - Indicates the origin of the CRM campaign (e.g., "Website," "Referral"). - Helps track campaign sources.
it: **Fonte CRM**: - Indica l'origine della campagna CRM (ad esempio, "Sito Web", "Riferimento"). - Aiuta a tracciare le fonti della campagna.

source: **View Icon**: Opens a detailed view of the user.
it: **Icona di Visualizzazione**: Apre una vista dettagliata dell'utente.

source: **Delete Icon**: Removes the user from the system.
it: **Icona di Eliminazione**: Rimuove l'utente dal sistema.

source: **Update Icon**: Opens the user form for editing.
it: **Icona di Aggiornamento**: Apre il modulo dell'utente per l'editing.

source: Managing Users
it: Gestione degli Utenti

source: Create a User
it: Crea un Utente

source: Navigate to the **View Users** page.
it: Vai alla pagina **Visualizza Utenti**.

source: Click the **Create User** button.
it: Clicca sul pulsante **Crea Utente**.

source: View a User
it: Visualizza un Utente

source: Users are displayed in a table format with all relevant details.
it: Gli utenti vengono visualizzati in formato tabellare con tutti i dettagli rilevanti.

source: Update a User
it: Aggiorna un Utente

source: On the **View Users** page, locate the user you want to modify.
it: Nella pagina **Visualizza Utenti**, individua l'utente che desideri modificare.

source: Delete a User
it: Elimina un Utente

source: On the **View Users** page, locate the user you want to delete.
it: Nella pagina **Visualizza Utenti**, individua l'utente che desideri eliminare.

source: Confirm the deletion to remove the user permanently.
it: Conferma l'eliminazione per rimuovere definitivamente l'utente.

source: Master Data
it: Dati Master

source: Roles
it: Ruoli

source: The **Roles** feature under the **Master Data** section provides tools for managing user roles within the GeneSys Admin application. Roles help define user permissions and access levels, enabling administrators to assign responsibilities effectively.
it: La funzionalità **Ruoli** nella sezione **Dati Master** fornisce strumenti per gestire i ruoli degli utenti all'interno dell'applicazione GeneSys Admin. I ruoli aiutano a definire le autorizzazioni e i livelli di accesso degli utenti, consentendo agli amministratori di assegnare le responsabilità in modo efficace.

source: Roles Management
it: Gestione dei Ruoli

source: The **Roles** menu contains the following options:
it: Il menu **Ruoli** contiene le seguenti opzioni:

source: **View Roles**: Displays a list of all created roles in a table format.
it: **Visualizza Ruoli**: Mostra un elenco di tutti i ruoli creati in formato tabellare.

source: **Create Role**: Allows administrators to add new roles to the system.
it: **Crea Ruolo**: Consente agli amministratori di aggiungere nuovi ruoli al sistema.

source: Viewing Roles
it: Visualizzazione dei Ruoli

source: To view existing roles:
it: Per visualizzare i ruoli esistenti:

source: Navigate to the **Master Data > Roles** section.
it: Vai alla sezione **Dati Master > Ruoli**.

source: Select **View Roles** from the dropdown menu.
it: Seleziona **Visualizza Ruoli** dal menu a discesa.

source: View Roles Table
it: Tabella dei Ruoli

source: A table listing all stored roles will appear, displaying the following columns:
it: Apparirà una tabella che elenca tutti i ruoli memorizzati, visualizzando le seguenti colonne:

source: **Role ID**: A unique, auto-generated identifier for each role.
it: **ID Ruolo**: Un identificatore unico generato automaticamente per ogni ruolo.

source: **Name**: The name of the role.
it: **Nome**: Il nome del ruolo.

source: **Description**: A brief description of the role.
it: **Descrizione**: Una breve descrizione del ruolo.

source: **Created At**: The date and time the role was created.
it: **Creato Il**: La data e l'ora in cui il ruolo è stato creato.

source: **Updated At**: The date and time the role was last updated.
it: **Aggiornato Il**: La data e l'ora in cui il ruolo è stato aggiornato l'ultima volta.

source: **Actions**: Interactive icons to update, delete, or view detailed information about a role.
it: **Azioni**: Icone interattive per aggiornare, eliminare o visualizzare informazioni detagliate su un ruolo.

source: Creating a Role
it: Creare un Ruolo

source: To create a new role:
it: Per creare un nuovo ruolo:

source: Select **Create Role** from the dropdown menu.
it: Seleziona **Crea Ruolo** dal menu a discesa.

source: Fill in the required fields: - **Name**: Enter a unique name for the role. - **Description**: Provide a brief description of the role.
it: Compila i campi obbligatori: - **Nome**: Inserisci un nome unico per il ruolo. - **Descrizione**: Fornisci una breve descrizione del ruolo.

source: Click **Save** to store the new role.
it: Fai clic su **Salva** per memorizzare il nuovo ruolo.

source: Create Role Form
it: Modulo per Creare Ruolo

source: Updating a Role
it: Aggiornare un Ruolo

source: To update an existing role:
it: Per aggiornare un ruolo esistente:

source: Navigate to the **View Roles** page.
it: Vai alla pagina **Visualizza Ruoli**.

source: Locate the role you want to modify.
it: Individua il ruolo che desideri modificare.

source: Click the **Edit** icon in the **Actions** column.
it: Fai clic sull'icona **Modifica** nella colonna **Azioni**.

source: Update the necessary fields and click **Save**.
it: Aggiorna i campi necessari e fai clic su **Salva**.

source: Deleting a Role
it: Eliminare un Ruolo

source: To delete an existing role:
it: Per eliminare un ruolo esistente:

source: Locate the role you want to delete.
it: Individua il ruolo che desideri eliminare.

source: Click the **Delete** icon in the **Actions** column.
it: Fai clic sull'icona **Elimina** nella colonna **Azioni**.

source: Confirm the deletion to permanently remove the role.
it: Conferma l'eliminazione per rimuovere definitivamente il ruolo.

source: Role-Based Access Control (RBAC)
it: Controllo Accessi Basato su Ruoli (RBAC)

source: The **RBAC** feature under **Master Data** includes:
it: La funzionalità **RBAC** sotto **Dati Master** include:

source: **Grant Access**: Assign roles and permissions to users.
it: **Concedi Accesso**: Assegna ruoli e autorizzazioni agli utenti.

source: **Roles**: Manage roles as described above.
it: **Ruoli**: Gestisci i ruoli come descritto sopra.

source: **Rules**: Define custom rules for access control.
it: **Regole**: Definisci regole personalizzate per il controllo degli accessi.

source: **Permissions**: Specify detailed permissions for each role.
it: **Autorizzazioni**: Specifica autorizzazioni dettagliate per ciascun ruolo.

source: The **Roles** feature in the GeneSys Admin application simplifies user management by providing a structured way to define and assign permissions. Use the intuitive interface to create, view, and modify roles effectively, enhancing security and operational efficiency.
it: La funzionalità **Ruoli** nell'applicazione GeneSys Admin semplifica la gestione degli utenti fornendo un modo strutturato per definire e assegnare autorizzazioni. Utilizza l'interfaccia intuitiva per creare, visualizzare e modificare i ruoli in modo efficace, migliorando la sicurezza e l'efficienza operativa.
